<?php

use Illuminate\Database\Seeder;

class RepliesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [1,1,'分期经理,经理,我是客户经理','keywords','','',0,7,],
            [2,1,'我要分期,我要','keywords','','',0,8,],
            [3,1,'中银E贷,中银e贷','keywords','','',0,10,],
            [4,1,'百果园','keywords','','',0,12,],
            [5,1,'申请进度,进度查询,如何查询申请进度','keywords','','',0,15,],
            [6,1,'聪明购,聪明购商城,聪明','keywords','','',0,16,],
            [7,1,'一分钱,1分钱,1分,秒杀','keywords','','',0,17,],
            [8,1,'ETC,怎么办理ETC,etc','keywords','','',0,55,],
            [9,1,'手机银行,APP,手机银行APP下载','keywords','','',0,19,],
            [10,1,'开户行查询,开户行','keywords','','',0,20,],
            [11,1,'积分,积分兑换,尊享积分,交易积分','keywords','','',0,21,],
            [12,1,'信用卡激活','keywords','','',0,22,],
            [13,1,'上网','keywords','','',0,23,],
            [14,1,'客服,客服电话,人工,人工服务','keywords','','',0,24,],
            [15,1,'余额查询,查询余额,怎么查询余额,余额','keywords','','',0,25,],
            [16,1,'附近网点,附近银行,周边网点','keywords','','',0,26,],
            [17,1,'我要办理信用卡,申请信用卡,信用卡,办信用卡','keywords','','',0,27,],
            [18,1,'一人一码','keywords','','',0,28,],
            [19,1,'充话费,话费,充话费满减','keywords','','',1,31,],
            [20,1,'5元观影,观影','keywords','','',1,33,],
            [21,1,'环保益起来,公益,环保','keywords','','',1,35,],
            [22,1,'现金分期,分期','keywords','','',1,37,],
            [23,1,'秒杀,1分钱,一分钱,报名,当周报名','keywords','','',1,41,],
            [24,1,'加油,加油券,加油卡','keywords','','',0,44,],
            [25,1,'高速','keywords','','',0,51,],
            [26,1,'5.5折','keywords','','',0,52,],
            [27,1,'反假小超人,反假','keywords','','',0,57,],
            [28,1,'企业手机银行,企业','keywords','','',0,58,],
            [29,1,'顺丰,顺丰急送','keywords','','',0,59,],
            [30,1,'以客荐客','keywords','','',0,61,],
            [31,1,'10元剪发,剪发','keywords','','',0,62,],
            [32,1,'丹尼斯,商超','keywords','','',1,66,],
            [33,1,'星巴克','keywords','','',1,68,],
            [34,1,'网易云,音乐,黑胶VIP,网易云音乐','keywords','','',1,70,],
            [35,1,'礼豫红包,礼豫,红包','keywords','','',0,71,],
            [36,1,'关注自动回复','subscribe','','',0,72,],
        ];
        foreach ($data as $k=>$v){
            DB::table('replies')->insert([
                    'id'=>$v[0],
                    'account_id' => $v[1],
                    'trigger_keywords' => $v[2],
                    'trigger_type' => $v[3],
                    'name' => $v[4],
                    'content' => $v[5],
                    'reply_type' => $v[6],
                    'material_id' => $v[7],
                ]
            );
        }
    }
}
